relocate pump, update readme
